import re

def find_bank(context):
    # 用正則找到判決書中的車牌並回傳位置
    # context: string 整篇或部分判決書

    regex = "((.{0,4})(銀行|郵局|郵政|信託|世華|金庫|商銀|企銀|開發|信合社|漁會|農會|信用合作社|中央信託局)(.{0,5})(帳號|帳戶|│)?(?:(?!年|元|月|萬|千|百|第)\w)(.{0,11})(?:(?!年|元|月|萬|千|百|第)\w)[0-9]{0,4}(-|─|－|—|–)?(?:(?!年|元|月|萬|千|百|第)\w)[0-9]{3,15}(.{0,9})(帳戶|存簿))|((.{0,4})(銀行|郵局|郵政|信託|世華|金庫|商銀|企銀|開發|信合社|漁會|農會|信用合作社|中央信託局)+(.{0,20})(帳號|帳戶|局號|│|卡號)(.{0,10})(?:(?!年|元|月|萬|千|百)\w)[0-9]{0,4}(-|─|－|—|–)?(?:(?!年|元|月|萬|千|百)\w)[0-9]{3,15}(?:(?!年|元|月|萬|千|百)\w)(號)?(帳戶)?(、)?[0-9]*)"


    match = re.finditer(regex, context)
    
    bank_list = []

    for one in match:
        print(one)
        start=one.span()[0]
        end=one.span()[1]
        value=context[start:end]
        
        bank_list.append({'start':start, 'end':end, 'value':value, 'type': 'bank'})
    
    return bank_list
